Revit 2024 API
BuiltInFailures.LoadFailures.PointLoadNotOverlappingHost Property
 Point load is not overlapping with its entire distribution its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PointLoadNotOverlappingHost { get; }
Visual Basic
Public Shared ReadOnly Property PointLoadNotOverlappingHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PointLoadNotOverlappingHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace